package JavaStart.TestString;

import java.util.Scanner;

public class TestString12 {
    public static void main (String[] args) {
        Scanner in = new Scanner(System.in);
        String text = in.nextLine();
        text = text.replace("a", "o");
        System.out.println(text);

    }
}

//Напишите программу которая заменяет в тексте все буквы 'a' ну букву 'о'.
//Ввод
//Java
//Вывод
//Jovo
//
//Ввод
//Bitlabacademy
//Вывод
//Bitlobocodemy