package JavaStart.Test;

public class Test3 {
    public static void main(String[] args) {

        String word = "Hello";
        String word1 = "Bitlab";
        System.out.println(word);
        System.out.println(word1);

    }
}

//Напишите программу, которая выводит текста "Hello" и "Bitlab" в двух разных строках как показано в примере:
//
//Вывод:
//Hello
//Bitlab
