package JavaStart.Test;

public class Test2 {
    public static void main(String[] args) {
        String word = "Hello, Bitlab! ";
        System.out.print(word);
        System.out.print(word);
    }
}

//Напишите программу для вывода в консоль строки "Hello, Bitlab!", но уже 2
//раза как показано в примере ниже.
//
//Вывод:
//Hello, Bitlab! Hello, Bitlab!
