package JavaStart.Test;

public class Test9 {
    public static void main(String[] args) {
        int soup = 850;
        int salad = 530;
        int tea = 245;

        System.out.println("TO PAY:");
        System.out.println("Soup - " + soup);
        System.out.println("Salad - " + salad);
        System.out.println("Tea - " + tea);
        System.out.println("- - -");
        System.out.println("Total - " + (soup + salad + tea));

    }
}

//Создайте программу, которая рассчитает полную сумму чека, если цена блюд заказанные юзером int soup = 850, int salad = 530, int tea = 245 и выведет в консоль как в примере.
//Вывод:
//TO PAY:
//Soup - 850
//Salad - 530
//Tea - 245
//- - -
//Total - 1625