package JavaStart.Test;

public class Test5 {
    public static void main(String[] args) {
        String country="Great Britain";
        String capital="London";

        System.out.println(capital + " is the capital of " + country + "!");
    }
}

//Создайте программу, в который будут переменные String country="Great Britain" и String capital="London". Программа должна выводить многим известную фразу как в примере.
//Вывод:
//London is the capital of Great Britain!