package JavaStart.Test;

public class Test1 {
    public static void main(String[] args) {
        String word = "Hello, World!";
        System.out.println(word);
    }
}

//Напишите программу для вывода на экран строки "Hello, World!".
//
//Вывод:
//Hello, World!