package JavaStart.Test;

public class Test4 {
    public static void main(String[] args) {
        String name = "George Washington";

        System.out.println("The first president of USA is " + name);
    }
}

//Напишите программу в которой вы создаете переменную String name = "George Washington" и выведите значение переменной на экран c дополнительной информацией как на примере.
//Вывод:
//The first president of USA is George Washington