package JavaStart.Test;

public class Test7 {
    public static void main(String[] args) {
        int number = 5;

        System.out.println(number * number * number);
    }
}

//Создайте переменную int number = 5  и выведите куб данного числа на экран.
//
//Вывод:
//125