package JavaStart.Test;

public class Test10 {
    public static void main(String[] args) {
        double examOne = 80.5;
        double examTwo = 55.7;

        System.out.println((examOne + examTwo) / 2);
    }
}

//Арман получил 80.5 баллов (double examOne = 80.5) на первом экзамене и 55.7 (double examTwo = 55.7) баллов на втором. Напишите программу которая вычислит средний балл Армана и выведет на экран.
//
//Вывод:
//68.1